SELECT "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ", "Н_ВЕДОМОСТИ"."ИД"
FROM "Н_ТИПЫ_ВЕДОМОСТЕЙ"
    INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ТВ_ИД" = "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД"
WHERE "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" < 3 AND DATE("Н_ВЕДОМОСТИ"."ДАТА") > '2010-06-18';

SELECT "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", "Н_СЕССИЯ"."УЧГОД"
FROM "Н_ЛЮДИ"
    LEFT JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
    LEFT JOIN "Н_СЕССИЯ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" > 'Сергеевич' AND DATE("Н_ВЕДОМОСТИ"."ДАТА") > '1998-01-05' AND "Н_СЕССИЯ"."ИД" > 14369;

SELECT COUNT("ДАТА_РОЖДЕНИЯ")
FROM (
    SELECT "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ" AS "ДАТА_РОЖДЕНИЯ"
    FROM "Н_ЛЮДИ"
    GROUP BY "ДАТА_РОЖДЕНИЯ"
) AS "число рождений без учета повторов";

SELECT "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД", COUNT("Н_ГРУППЫ_ПЛАНОВ"."ГРУППА")
FROM "Н_ГРУППЫ_ПЛАНОВ"
    JOIN "Н_ПЛАНЫ" ON "Н_ПЛАНЫ"."ИД" = "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД"
    JOIN "Н_ОТДЕЛЫ" ON "Н_ОТДЕЛЫ"."ИД" = "Н_ПЛАНЫ"."ОТД_ИД"
WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
GROUP BY "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД"
HAVING COUNT("Н_ГРУППЫ_ПЛАНОВ"."ГРУППА") > 2;

SELECT "Н_УЧЕНИКИ"."ГРУППА", AVG(DATE_PART('year', AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")))
FROM "Н_ЛЮДИ"
    JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
GROUP BY "Н_УЧЕНИКИ"."ГРУППА"
HAVING AVG(DATE_PART('year', AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))) > (
    SELECT MIN(DATE_PART('year', AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")))
    FROM "Н_ЛЮДИ"
        JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
    WHERE "Н_УЧЕНИКИ"."ГРУППА" = '3100'
);

SELECT "ВСЕ_УЧЕНИКИ"."ГРУППА",
        "ВСЕ_УЧЕНИКИ"."ИД",
        "Н_ЛЮДИ"."ФАМИЛИЯ",
        "Н_ЛЮДИ"."ИМЯ",
        "Н_ЛЮДИ"."ОТЧЕСТВО",
        "ВСЕ_УЧЕНИКИ"."П_ПРКОК_ИД"
FROM "Н_УЧЕНИКИ" AS "ВСЕ_УЧЕНИКИ"
    JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "ВСЕ_УЧЕНИКИ"."ЧЛВК_ИД"
    JOIN "Н_ПЛАНЫ" ON "ВСЕ_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
    JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
AND ("Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная' OR "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная')
    JOIN "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" ON "Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
    JOIN "Н_НАПР_СПЕЦ" ON "Н_НАПР_СПЕЦ"."ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД"
AND "Н_НАПР_СПЕЦ"."КОД_НАПРСПЕЦ" = '230101'
WHERE "ВСЕ_УЧЕНИКИ"."ИД" IN (SELECT "ОТЧИСЛ_УЧЕНИКИ"."ИД"
FROM "Н_УЧЕНИКИ" AS "ОТЧИСЛ_УЧЕНИКИ"
WHERE "ОТЧИСЛ_УЧЕНИКИ"."ИД" = "ВСЕ_УЧЕНИКИ"."ИД"
    AND "ОТЧИСЛ_УЧЕНИКИ"."ПРИЗНАК" = 'отчисл'
    AND "ОТЧИСЛ_УЧЕНИКИ"."СОСТОЯНИЕ" = 'утвержден'
    AND DATE("ОТЧИСЛ_УЧЕНИКИ"."КОНЕЦ") = '2012-09-01');

SELECT COUNT(*) AS "ЧИСЛО_ХОРОШИСТОВ"
FROM (SELECT "Н_УЧЕНИКИ"."ИД"
    FROM "Н_УЧЕНИКИ"
        JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
        JOIN "Н_ОТДЕЛЫ" ON "Н_ОТДЕЛЫ"."ИД" = "Н_ПЛАНЫ"."ОТД_ИД"
        JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
    AND "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[2-5]$'
    GROUP BY "Н_УЧЕНИКИ"."ИД"
    HAVING MIN(CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS INT)) >= 4
    AND MIN(CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS INT)) < 5);