EXPLAIN ANALYZE SELECT "Н_ЛЮДИ"."ИД", "Н_СЕССИЯ"."ДАТА"
FROM "Н_ЛЮДИ"
    INNER JOIN "Н_СЕССИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" = 'Александрович' AND "Н_СЕССИЯ"."ДАТА" = '2012-01-25';

--CREATE INDEX "ИНДЕКС_ЛЮДИ_ИД" ON "Н_ЛЮДИ" USING hash("ИД");
--CREATE INDEX "ИНДЕКС_ЛЮДИ_ОТЧЕСТВО" ON "Н_ЛЮДИ" USING hash("ОТЧЕСТВО");
--CREATE INDEX "ИНДЕКС_СЕССИЯ_ЧЛВК_ИД" ON "Н_СЕССИЯ" USING hash("ЧЛВК_ИД");
--CREATE INDEX "ИНДЕКС_СЕССИЯ_ДАТА" ON "Н_СЕССИЯ" USING hash("ДАТА");

EXPLAIN ANALYZE SELECT "Н_ЛЮДИ"."ИД", "Н_ВЕДОМОСТИ"."ИД", "Н_СЕССИЯ"."УЧГОД"
FROM "Н_ЛЮДИ"
    INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
    INNER JOIN "Н_СЕССИЯ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ИД" > 100012 AND "Н_ВЕДОМОСТИ"."ДАТА" > '2022-06-08' AND "Н_СЕССИЯ"."ИД" = 14;

--CREATE INDEX "ИНДЕКС_ЛЮДИ_ИД" ON "Н_ЛЮДИ" USING btree("ИД");
--CREATE INDEX "ИНДЕКС_ВЕДОМОСТИ_ЧЛВК_ИД" ON "Н_ВЕДОМОСТИ" USING hash("ЧЛВК_ИД");
--CREATE INDEX "ИНДЕКС_ВЕДОМОСТИ_ДАТА" ON "Н_ВЕДОМОСТИ" USING btree("ДАТА");
--CREATE INDEX "ИНДЕКС_СЕССИЯ_ЧЛВК_ИД" ON "Н_СЕССИЯ" USING hash("ЧЛВК_ИД");
--CREATE INDEX "ИНДЕКС_СЕССИЯ_ИД" ON "Н_СЕССИЯ" USING hash("ИД");